In [2]:
import pandas as pd

In [3]:
import numpy as np
from numpy.random import randn

In [4]:
data=pd.DataFrame(randn(4,5),index='a b c d'.split(),columns='wt ht lt bt t'.split())
data

         wt        ht        lt        bt         t
a  1.748788  0.539524 -1.554843 -0.522166  0.024443
b  0.168408  2.080214  0.809102 -1.240970 -0.399283
c  0.176383  0.506976 -0.372938 -0.223696  0.139909
d -0.027504  0.612760 -0.452820  0.580643 -1.209150

In [5]:
# call a column using query notation
data.t

a    0.024443
b   -0.399283
c    0.139909
d   -1.209150
Name: t, dtype: float64

In [6]:
# call a column using list notation
data[['t','wt']]

          t        wt
a  0.024443  1.748788
b -0.399283  0.168408
c  0.139909  0.176383
d -1.209150 -0.027504

In [7]:
# call a row using list notation
data.loc['a']

wt    1.748788
ht    0.539524
lt   -1.554843
bt   -0.522166
t     0.024443
Name: a, dtype: float64

In [8]:
# call a row using index
data.iloc[0]

wt    1.748788
ht    0.539524
lt   -1.554843
bt   -0.522166
t     0.024443
Name: a, dtype: float64

In [9]:
# call cell using list notation
data.loc['a', 'wt']

1.7487880294688563

In [10]:
# call rows and columns using list notation
data.loc[['a','b'], ['wt','ht']]

         wt        ht
a  1.748788  0.539524
b  0.168408  2.080214

In [12]:
# filter dataframe for values more than zero and display as true and false
data>0

      wt    ht     lt     bt      t
a   True  True  False  False   True
b   True  True   True  False  False
c   True  True  False  False   True
d  False  True  False   True  False

In [13]:
# filter dataframe for values and show outputs
data[data>0]

         wt        ht        lt        bt         t
a  1.748788  0.539524       NaN       NaN  0.024443
b  0.168408  2.080214  0.809102       NaN       NaN
c  0.176383  0.506976       NaN       NaN  0.139909
d       NaN  0.612760       NaN  0.580643       NaN

In [14]:
# filter dataframe for rows with Wt < 0 and show outputs
data[data['wt']<0]

         wt       ht       lt        bt        t
d -0.027504  0.61276 -0.45282  0.580643 -1.20915

In [15]:
# show values only for height and length, where Wt < 0 and show outputs
data[data['wt']<0][['ht','lt']]

        ht       lt
d  0.61276 -0.45282

In [16]:
# filter dataframe for rows with Wt < 0, bt>0 and show outputs
data[(data['wt']<0) & (data['bt']>0)]

         wt       ht       lt        bt        t
d -0.027504  0.61276 -0.45282  0.580643 -1.20915

In [17]:
# Add area as column
data['area']=data['ht']*data['lt']
data

         wt        ht        lt        bt         t      area
a  1.748788  0.539524 -1.554843 -0.522166  0.024443 -0.838875
b  0.168408  2.080214  0.809102 -1.240970 -0.399283  1.683104
c  0.176383  0.506976 -0.372938 -0.223696  0.139909 -0.189071
d -0.027504  0.612760 -0.452820  0.580643 -1.209150 -0.277470

In [18]:
# Drop a column. Ex: area
data.drop('area',axis=1,inplace=True)

In [19]:
data

         wt        ht        lt        bt         t
a  1.748788  0.539524 -1.554843 -0.522166  0.024443
b  0.168408  2.080214  0.809102 -1.240970 -0.399283
c  0.176383  0.506976 -0.372938 -0.223696  0.139909
d -0.027504  0.612760 -0.452820  0.580643 -1.209150

In [20]:
# Drop a row
data.drop(['a'],axis=0)

         wt        ht        lt        bt         t
b  0.168408  2.080214  0.809102 -1.240970 -0.399283
c  0.176383  0.506976 -0.372938 -0.223696  0.139909
d -0.027504  0.612760 -0.452820  0.580643 -1.209150

In [21]:
# Assing id number to rows and Set it as an index
data['id']=[10,11,12,13]
data.set_index('id')

          wt        ht        lt        bt         t
id
10  1.748788  0.539524 -1.554843 -0.522166  0.024443
11  0.168408  2.080214  0.809102 -1.240970 -0.399283
12  0.176383  0.506976 -0.372938 -0.223696  0.139909
13 -0.027504  0.612760 -0.452820  0.580643 -1.209150

In [22]:
# Use to layers of indexing
batch='y1 y1 y1 y2'.split()
idcard=[101,111,121,131]
newid=list[zip(batch,idcard)]
#data['id2']=newid
#data.pd.Multiindex.from_tuples('id2')

In [23]:
# Sorting by index
data.sort_index(ascending=False)

         wt        ht        lt        bt         t  id
d -0.027504  0.612760 -0.452820  0.580643 -1.209150  13
c  0.176383  0.506976 -0.372938 -0.223696  0.139909  12
b  0.168408  2.080214  0.809102 -1.240970 -0.399283  11
a  1.748788  0.539524 -1.554843 -0.522166  0.024443  10

In [24]:
# Sorting by weight, ascending
data['wt'].sort_values()

d   -0.027504
b    0.168408
c    0.176383
a    1.748788
Name: wt, dtype: float64

In [25]:
# Sorting dataframe by weight
data.sort_values(by='wt')

         wt        ht        lt        bt         t  id
d -0.027504  0.612760 -0.452820  0.580643 -1.209150  13
b  0.168408  2.080214  0.809102 -1.240970 -0.399283  11
c  0.176383  0.506976 -0.372938 -0.223696  0.139909  12
a  1.748788  0.539524 -1.554843 -0.522166  0.024443  10

In [26]:
# Sorting dataframe by weight ascending and height descening
data.sort_values(by=['wt','ht'],ascending=[True,False])

         wt        ht        lt        bt         t  id
d -0.027504  0.612760 -0.452820  0.580643 -1.209150  13
b  0.168408  2.080214  0.809102 -1.240970 -0.399283  11
c  0.176383  0.506976 -0.372938 -0.223696  0.139909  12
a  1.748788  0.539524 -1.554843 -0.522166  0.024443  10

In [27]:
# Minumum value for weight
data['wt'].min()

-0.027504200160943366

In [28]:
# Minumum value for weight
data.loc[data['wt']==data['wt'].min()]

         wt       ht       lt        bt        t  id
d -0.027504  0.61276 -0.45282  0.580643 -1.20915  13

In [29]:
# Rows with values with ids 12,13
data.loc[data['id'].isin([12,13])]

         wt        ht        lt        bt         t  id
c  0.176383  0.506976 -0.372938 -0.223696  0.139909  12
d -0.027504  0.612760 -0.452820  0.580643 -1.209150  13

In [30]:
# Rows with values where wt<0 and ids 12,13
data.loc[(data['wt']<0) & (data['id'].isin([12,13]))]

         wt       ht       lt        bt        t  id
d -0.027504  0.61276 -0.45282  0.580643 -1.20915  13

In [31]:
# Index of the row with Minumum value for weight
print(*data[data['wt']==data['wt'].min()].index.values)
data[data['wt']>data['wt'].min()].index[0]

d

'a'